# TransferringProjectStandardsEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransferringProjectStandardsEventArgs Class
Members See Also
---
The event arguments used by the TransferringProjectStandards event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017.2
# Syntax
C#
---
```text
public class TransferringProjectStandardsEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class TransferringProjectStandardsEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class TransferringProjectStandardsEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.UI.Events..::..TransferringProjectStandardsEventArgs
# See Also
TransferringProjectStandardsEventArgs Members
Autodesk.Revit.UI.Events Namespace